---
kind: type
id: T:Autodesk.Revit.DB.Architecture.RoomTag
source: html/3593ae3b-3046-4fd1-ced3-ce1368e3adb3.htm
---
# Autodesk.Revit.DB.Architecture.RoomTag

Provides access to the room tag in Autodesk Revit.

## Syntax (C#)
```csharp
public class RoomTag : SpatialElementTag
```